# -*- encoding: utf-8 -*-
#При выполнении дз использовать Git (делать коммиты, работать в develop ветке,
# для каждой задачи отдельная feature/<название_ветки> ветка из develop ветки,
# после завершения работы над задачей - делать merge feature ветки в dev ветку,
# после выполнения всех заданий сделать merge develop в master)
#
#
# 1. Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа
# выводит на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
#
#
#
# 2. Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа
# переводит метры в мили, дюймы или ярды.

