# -*- encoding: utf-8 -*-
#При выполнении дз использовать Git (делать коммиты, работать в develop ветке,
# для каждой задачи отдельная feature/<название_ветки> ветка из develop ветки,
# после завершения работы над задачей - делать merge feature ветки в dev ветку,
# после выполнения всех заданий сделать merge develop в master)
#
#
# 1. Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа
# выводит на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
#
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))
# num3 = int(input("Введите третье число: "))
#
# big = num1
# if big < num2:
#     big = num2
# if big < num3:
#     big = num3
#
# print("Большее из введеных: ", big)
#
# small = num1
# if small > num2:
#     small = num2
# if small > num3:
#     small = num3
#
# print("Меньшее из введеных: ", small)
#
# sum = num1 + num2 +num3
# midar = sum/3
#
# print("Среднее арифметическое чисел: ", midar)
#
# 2. Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа
# переводит метры в мили, дюймы или ярды.

# meter = int(input("Введите кол-во метров: "))
# choice = input("мили, дюймы или ярды :")
#
# if choice == "мили":
#     print(meter*0.00062)
# if choice == "дюймы":
#     print(meter*39.37)
# if choice == "ярды":
#     print(meter*1.093)
#


